Revit 2027 API
GroupTypeId.FireProtection Property
 Fire Protection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FireProtection { get; }
Public Shared ReadOnly Property FireProtection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FireProtection {
	ForgeTypeId^ get ();
}
static member FireProtection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace